# Querying Multiple Tables

In [1]:
import pandas as pd
import pymysql

In [2]:
# Database connection
try:
    conn = pymysql.connect(
        host='localhost',
        user='newuser',
        passwd='password',
        db='sakila'
    )
    print('Connection established:\n', conn)
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
    print("Ocurrió un error al conectar: ", e)

Connection established:
 <pymysql.connections.Connection object at 0x7f522ac97af0>

## Exercise 5-1

Fill in the blanks (denoted by <#>) for the following query to obtain the results that follow:...

In [3]:
pd.read_sql_query(
    "SELECT c.first_name, c.last_name, a.address, ct.city\
       FROM customer c\
       INNER JOIN address a\
       ON c.address_id = a.address_id\
       INNER JOIN city ct\
       ON a.city_id = ct.city_id\
       WHERE a.district = 'California'", 
    conn)

  first_name  last_name                 address            city
0   PATRICIA    JOHNSON        1121 Loja Avenue  San Bernardino
1      BETTY      WHITE    770 Bydgoszcz Avenue  Citrus Heights
2      ALICE    STEWART  1135 Izumisano Parkway         Fontana
3       ROSA   REYNOLDS     793 Cam Ranh Avenue       Lancaster
4      RENEE       LANE    533 al-Ayn Boulevard         Compton
5    KRISTIN   JOHNSTON         226 Brest Manor       Sunnyvale
6  CASSANDRA    WALTERS     920 Kumbakonam Loop         Salinas
7      JACOB      LANCE    1866 al-Qatif Avenue        El Monte
8       RENE  MCALISTER  1895 Zhezqazghan Drive    Garden Grove

## Exercise 5-2

Write a query that returns the title of every film in which an actor with the first name JOHN appeared.

In [11]:
pd.read_sql_query(
    "SELECT f.title\
       FROM film f\
         INNER JOIN film_actor fa\
         ON f.film_id = fa.film_id\
         INNER JOIN actor a\
         ON fa.actor_id = a.actor_id\
       WHERE a.first_name = 'JOHN'", 
    conn)

                        title
0             ALLEY EVOLUTION
1              BEVERLY OUTLAW
2              CANDLES GRAPES
3             CLEOPATRA DEVIL
4          COLOR PHILADELPHIA
5              CONQUERER NUTS
6            DAUGHTER MADIGAN
7         GLEAMING JAWBREAKER
8             GOLDMINE TYCOON
9                   HOME PITY
10         INTERVIEW LIAISONS
11           ISHTAR ROCKETEER
12               JAPANESE RUN
13               JERSEY SASSY
14                 LUKE MUMMY
15                MILLION ACE
16          MONSTER SPARTACUS
17             NAME DETECTIVE
18          NECKLACE OUTBREAK
19              NEWSIES STORY
20               PET HAUNTING
21           PIANIST OUTFIELD
22            PINOCCHIO SIMON
23       PITTSBURGH HUNCHBACK
24                QUILLS BULL
25            RAGING AIRPLANE
26              ROXANNE REBEL
27  SATISFACTION CONFIDENTIAL
28                SONG HEDWIG

## Exercise 5-3

Construct a query that returns all addresses that are in the same city.

In [15]:
pd.read_sql_query(
    "SELECT a1.address addr1, a2.address addr2, a1.city_id\
       FROM address a1\
         INNER JOIN address a2\
         ON a1.city_id = a2.city_id\
           AND a1.address < a2.address", 
    conn)

                  addr1               addr2  city_id
0     23 Workhaven Lane   47 MySakila Drive      300
1  1411 Lillydale Drive  28 MySQL Boulevard      576
2     1497 Yuzhou Drive  548 Uruapan Street      312
3      43 Vilnius Manor  587 Benguela Manor       42

In [18]:
conn.close()

In [14]:
# These libraries are pre-installed in SN Labs. If running in another environment please uncomment lines below to install them:
# !pip install --force-reinstall ibm_db==3.1.0 ibm_db_sa==0.3.3
# Ensure we don't load_ext with sqlalchemy>=1.4 (incompadible)
!pip uninstall sqlalchemy==1.4 -y && pip install sqlalchemy==1.3.24
!pip install ipython-sql

Found existing installation: SQLAlchemy 1.3.24
Uninstalling SQLAlchemy-1.3.24:
  Successfully uninstalled SQLAlchemy-1.3.24
Collecting sqlalchemy==1.3.24
  Using cached SQLAlchemy-1.3.24-cp39-cp39-manylinux2010_x86_64.whl (1.3 MB)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.24
Requirement already satisfied: ipython-sql in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (0.4.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (1.3.24)
Requirement already satisfied: six in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: prettytable<1 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: matplotlib-inline in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: traitlets>=4.2 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (3.0.27)
Requirement already satisfied: setuptools>=18.5 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: decorator in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pygments in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: pexpect>4.3 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: backcall in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /home/javier/anaconda3/envs/SQL/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [15]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [19]:
%sql mysql://newuser:password@localhost/sakyla

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])
No module named 'MySQLdb'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [17]:
!pip install MySQL-python

Collecting MySQL-python
  Using cached MySQL-python-1.2.5.zip (108 kB)
  Preparing metadata (setup.py) ... error
  error: subprocess-exited-with-error

  × python setup.py egg_info did not run successfully.
  │ exit code: 1
  ╰─> [8 lines of output]
      Traceback (most recent call last):
        File "<string>", line 2, in <module>
        File "<pip-setuptools-caller>", line 34, in <module>
        File "/tmp/pip-install-wo33ij3y/mysql-python_07de2e8f94c84673b5432147b3d22efb/setup.py", line 13, in <module>
          from setup_posix import get_config
        File "/tmp/pip-install-wo33ij3y/mysql-python_07de2e8f94c84673b5432147b3d22efb/setup_posix.py", line 2, in <module>
          from ConfigParser import SafeConfigParser
      ModuleNotFoundError: No module named 'ConfigParser'
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
error: metadata-generation-failed

× Encountered error while generating package metadata.
╰─> See above for output.

note: This is an issue with the package mentioned above, not pip.
hint: See above for details.

In [18]:
!conda install -c anaconda mysql-python

Collecting package metadata (current_repodata.json): done
Solving environment: failed with initial frozen solve. Retrying with flexible solve.
Solving environment: failed with repodata from current_repodata.json, will retry with next repodata source.
Collecting package metadata (repodata.json): done
Solving environment: failed with initial frozen solve. Retrying with flexible solve.
Solving environment: \
Found conflicts! Looking for incompatible packages.
This can take several minutes.  Press CTRL-C to abort.
                                                                               failed

UnsatisfiableError: The following specifications were found
to be incompatible with the existing python installation in your environment:

Specifications:

  - mysql-python -> python[version='>=2.7,<2.8.0a0']

Your python: python=3.9

If python is on the left-most side of the chain, that's the version you've asked for.
When python appears to the right, that indicates that the thing on the left is somehow
not available for the python version you are constrained to. Note that conda will not
change your python version to a different minor version unless you explicitly specify
that.

The following specifications were found to be incompatible with your system:

  - feature:/linux-64::__glibc==2.31=0
  - mysql-python -> libgcc-ng[version='>=7.3.0'] -> __glibc[version='>=2.17']
  - python=3.9 -> libgcc-ng[version='>=7.5.0'] -> __glibc[version='>=2.17']

Your installed version is: 2.31



Note: you may need to restart the kernel to use updated packages.